In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
import os
os.chdir('P:\SAMPLE DATA')

In [3]:
df=pd.read_excel('members address.xlsx')

In [7]:
df.head()

       id MemberStatus MemberType PostTown   latitude  longitude
0  664331     Resigned      Staff  Norwich  52.644997   1.117492
1  671011     Resigned       Full  Norwich  52.645622   1.107749
2  663414     Resigned  Associate  Norwich  52.645622   1.107749
3  662314     Resigned       Full  Norwich  52.654073   1.152714
4  670888       Active   Affinity     Lyng  52.706098   1.078216

In [4]:
df.columns

Index(['AddressLine1', 'AddressLine2', 'AddressLine3', 'AlphaCode', 'County',
       'MemberNumber', 'MemberStatus', 'MemberType', 'PostTown', 'Postcode',
       'TradingName', 'latitude', 'longitude'],
      dtype='object')

In [5]:
df.drop(['AddressLine1', 'AddressLine2', 'AddressLine3', 'AlphaCode', 'County',
       'TradingName','Postcode'], axis=1, inplace=True)

In [6]:
df=df.rename(columns={'MemberNumber':'id'})

In [8]:
members=df.copy()

In [9]:
members.head()

       id MemberStatus MemberType PostTown   latitude  longitude
0  664331     Resigned      Staff  Norwich  52.644997   1.117492
1  671011     Resigned       Full  Norwich  52.645622   1.107749
2  663414     Resigned  Associate  Norwich  52.645622   1.107749
3  662314     Resigned       Full  Norwich  52.654073   1.152714
4  670888       Active   Affinity     Lyng  52.706098   1.078216

In [10]:
supplier=pd.read_excel('supplier.xlsx')

In [11]:
supplier.head()

,Address 1,Address 2,Address 3,County,Distribution,Email,Fax,Latitude,Local Name,Longitude,Manager,Member Collection,Postcode,Supplier,Telephone,Town
0,Bourtie Works,Bourtie,NaN,Aberdeenshire,Agrii,chemorders@agrii.co.uk,NaN,57.305616,Bourtie,-2.376063,NaN,YES,AB51 0HL,Agrii (UK) Limited,01467 626185,Inverurie
1,Rosehall,NaN,NaN,Aberdeenshire,Agrii,chemorders@agrii.co.uk,NaN,57.534888,Turriff,-2.484778,NaN,YES,AB53 4HD,Agrii (UK) Limited,01888 569138,Turriff
2,11 Cunningburn Road,Newtownards,NaN,Northern Ireland,Agrii,chemorders@agrii.co.uk,NaN,54.568699,Newtownards,-5.626769,NaN,YES,BT22 2AN,Agrii (UK) Limited,02891 812080,County Down
3,Elliot Industrial Estate,NaN,NaN,Angus,Agrii,chemorders@agrii.co.uk,NaN,56.552962,Arbroath,-2.618076,NaN,YES,DD11 2NJ,Agrii (UK) Limited,01241 431317,Arbroath
4,Kirriemuir Road,NaN,NaN,Angus,Agrii,chemorders@agrii.co.uk,NaN,56.653943,Forfar,-2.895783,NaN,YES,DD8 3TG,Agrii (UK) Limited,01307 464949,Forfar

In [12]:
supplier.columns

Index(['Address 1', 'Address 2', 'Address 3', 'County', 'Distribution',
       'Email', 'Fax', 'Latitude', 'Local Name', 'Longitude', 'Manager',
       'Member Collection', 'Postcode', 'Supplier', 'Telephone', 'Town'],
      dtype='object')

In [13]:
supplier.drop(['Address 1', 'Address 2', 'Address 3','Distribution',
       'Email', 'Fax', 'Local Name','Manager',
       'Member Collection', 'Postcode', 'Telephone'], axis=1, inplace=True )

In [20]:
supplier.head()

              County        lat       lon                name
0      Aberdeenshire  57.305616 -2.376063  Agrii (UK) Limited
1      Aberdeenshire  57.534888 -2.484778  Agrii (UK) Limited
2   Northern Ireland  54.568699 -5.626769  Agrii (UK) Limited
3              Angus  56.552962 -2.618076  Agrii (UK) Limited
4              Angus  56.653943 -2.895783  Agrii (UK) Limited

In [15]:
supplier=supplier.rename(columns={'Supplier':'name'})

In [16]:
supplier.drop('Town', axis=1, inplace=True)

In [17]:
members=members.rename(columns = {'latitude':'lat','longitude':'lon'})

In [18]:
supplier=supplier.rename(columns = {'Latitude':'lat','Longitude':'lon'})

In [19]:
members.info() 
supplier.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49687 entries, 0 to 49686
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            49687 non-null  int64
 1   MemberStatus  49687 non-null  object
 2   MemberType    49687 non-null  object
 3   PostTown      49686 non-null  object
 4   lat           49155 non-null  float64
 5   lon           49155 non-null  float64
dtypes: float64(2), int64(1), object(3)
memory usage: 2.3+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128 entries, 0 to 127
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   County  128 non-null    object
 1   lat     128 non-null    float64
 2   lon     128 non-null    float64
 3   name    128 non-null    object
dtypes: float64(2), object(2)
memory usage: 4.1+ KB

In [21]:
members.isnull().sum()

id                0
MemberStatus      0
MemberType        0
PostTown          1
lat             532
lon             532
dtype: int64

In [22]:
members.dropna(inplace=True)

In [23]:
supplier.isnull().sum()

County    0
lat       0
lon       0
name      0
dtype: int64

In [24]:
supplier.columns

Index(['County', 'lat', 'lon', 'name'], dtype='object')

In [25]:
from math import radians, cos, sin, asin, sqrt
def dist(lat1, long1, lat2, long2):
    """
    Calculate the great circle distance between two points 
    on the earth (specified in decimal degrees)
    """
    
    lat1, long1, lat2, long2 = map(radians, [lat1, long1, lat2, long2])
    
    dlon = long2 - long1 
    dlat = lat2 - lat1 
    a = sin(dlat/2)**2 + cos(lat1) * cos(lat2) * sin(dlon/2)**2
    c = 2 * asin(sqrt(a)) 
    # Radius of is 6371
    km = 6371* c
    return km

In [26]:
def find_nearest(lat, long):
    distances = supplier.apply(
        lambda row: dist(lat, long, row['lat'], row['lon']), 
        axis=1)
    return supplier.loc[distances.idxmin(), 'name']

In [27]:
members['name'] = members.apply(
    lambda row: find_nearest(row['lat'], row['lon']), 
    axis=1)
members.head()

,id,MemberStatus,MemberType,PostTown,lat,lon,name
0,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited
1,671011,Resigned,Full,Norwich,52.645622,1.107749,Frontier Agriculture Limited
2,663414,Resigned,Associate,Norwich,52.645622,1.107749,Frontier Agriculture Limited
3,662314,Resigned,Full,Norwich,52.654073,1.152714,Frontier Agriculture Limited
4,670888,Active,Affinity,Lyng,52.706098,1.078216,Frontier Agriculture Limited

In [28]:
members = pd.merge(members,supplier[['name','lat','lon']],on='name', how='left')
members=members.rename(columns = {'lat_x':'m_lat','lon_x':'m_lon','lat_y':'h_lat','lon_y':'h_lon'})
members.head()

,id,MemberStatus,MemberType,PostTown,m_lat,m_lon,name,h_lat,h_lon
0,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,51.940961,-2.546514
1,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,52.376072,1.126557
2,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,57.694844,-4.169837
3,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,53.600351,-2.864265
4,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,53.316167,-0.346784

In [29]:
from math import radians, cos, sin, asin, sqrt
def haversine(lon1, lat1, lon2, lat2):
    """
    Calculate the great circle distance between two points 
    on the earth (specified in decimal degrees)
    """
    # convert decimal degrees to radians 
    lon1, lat1, lon2, lat2 = map(radians, [lon1, lat1, lon2, lat2])
    # haversine formula 
    dlon = lon2 - lon1 
    dlat = lat2 - lat1 
    a = sin(dlat/2)**2 + cos(lat1) * cos(lat2) * sin(dlon/2)**2
    c = 2 * asin(sqrt(a)) 
    # Radius of earth in kilometers is 6371
    km = 6371* c
    return km

In [30]:
members['distance'] = [haversine(members.m_lon[i],members.m_lat[i],members.h_lon[i],members.h_lat[i]) for i in range(len(members))]
members['distance'] = members['distance'].round(decimals=3)

In [31]:
members.head()

,id,MemberStatus,MemberType,PostTown,m_lat,m_lon,name,h_lat,h_lon,distance
0,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,51.940961,-2.546514,261.161
1,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,52.376072,1.126557,29.909
2,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,57.694844,-4.169837,653.817
3,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,53.600351,-2.864265,286.096
4,664331,Resigned,Staff,Norwich,52.644997,1.117492,Frontier Agriculture Limited,53.316167,-0.346784,123.203

In [32]:
members.to_csv("dist.csv")

In [100]:
members.shape

(620014, 10)

In [103]:
file1=members[['id','m_lat','m_lon']].copy()

In [104]:
file1.head()

       id      m_lat     m_lon
0  664331  52.644997  1.117492
1  664331  52.644997  1.117492
2  664331  52.644997  1.117492
3  664331  52.644997  1.117492
4  664331  52.644997  1.117492

In [105]:
file2=members[['name','h_lat','h_lon']].copy()

In [106]:
file2.head()

                           name      h_lat     h_lon
0  Frontier Agriculture Limited  51.940961 -2.546514
1  Frontier Agriculture Limited  52.376072  1.126557
2  Frontier Agriculture Limited  57.694844 -4.169837
3  Frontier Agriculture Limited  53.600351 -2.864265
4  Frontier Agriculture Limited  53.316167 -0.346784

In [107]:
file1.to_csv('mem.csv')

In [108]:
file2.to_csv('sup.csv')